# Pandas

Pandas is a powerful library for data manipulation and analysis in Python. It is widely used in a range of fields, including data science, finance, and statistics.

1. Import pandas
1. Enable matplotlib to print inline

In [1]:
import pandas as pd
import numpy as np
import sqlalchemy
%matplotlib inline

## 000. Assets

Some assets to avoid too much typing

In [2]:
names_as_list = ["Mbappé", "De Bruyne", "Lewandowski", "Benzema", "Messi"]
ages_as_list = [ 23,       31,          33,             34,        35]

## 001. Importing / Exporting data

### 001.001 Dictionary of arrays

1. Replicate this data as a dataframe with a dictionary of arrays
1. Show it with head()

| Name        | Age|
|-------------|----|
| Mbappé      | 23 |
| De Bruyne   | 31 |
| Lewandowski | 33 |
| Benzema     | 34 |
| Messi       | 35 |

In [ ]:
#

          Name  Age
0       Mbappé   23
1    De Bruyne   31
2  Lewandowski   33
3      Benzema   34
4        Messi   35

### 001.002 List of dictionaries

1. Create a list where every entry is a dict with keys "Name" and "Age"
1. Continue as per 001.002

In [ ]:
#

          Name  Age
0       Mbappé   23
1    De Bruyne   31
2  Lewandowski   33
3      Benzema   34
4        Messi   35

### 001.003 2D Numpy array

1. Create a Nump 2D array with the same data
2. Continue as per 001.002
3. Make sure the colum names are still "Name" and "Age"

In [ ]:
#

          Name Age
0       Mbappé  23
1    De Bruyne  31
2  Lewandowski  33
3      Benzema  34
4        Messi  35

### 001.004 Pandas Series

1. Replicate 001.003 but create two pandas series from the two lists, and then concatenate them
1. Make sure the colum names are still "Name" and "Age"

In [1]:
#

### 001.005 SQL (sqlite)

1. Create a DataFrame by reading from table 'players' in SQLite DB "001.005.sqlite" with the built-in SQLite module. Note that the index column is called 'id'
1. Show it with df.head()
1. Change the Last Update column to the current timestamp in the DataFrame
1. Write the updated DataFrame data to the database. Make sure you tell the function to use the 'id' column for indices
1. Load the data again in a new DataFrame
1. Show it with df.head(), and confirm it's different from the previous one.
1. Also confirm there are no extra index columns

In [2]:
#

### 001.006 SQL (sqlalchemy)

1. Replicate 001.005 but use sqlalchemy to connect to the DB

(Note: you will probably get warnings, but you can ignore them)

In [3]:
#

### 001.007 TSV file

1. Replicate 001.005 but with the TSV file "[001.007.tsv](001.007.tsv)". Save that file location to a variable
1. TSV is a CSV but with "\t" as seprator
1. Bear in mind the same issues as 001.004 for index columns

In [4]:
data_file = "001.007.tsv"
#

### 001.008 JSON file

1. Replicate 001.005 but with the JSON file "[001.008.json](001.008.json)". Save that file location to a variable
1. Make sure non ASCII characters are readable

In [5]:
data_file = "001.008.json"
#

### 001.009 From a table in an HTML page

1. Replicate 001.005 but with the HTML file "[001.009.html](001.009.html)". Save that file location to a variable
1. Make sure there is only a single header row, ids are shown, and the ID column is called 'ID'

In [6]:
data_file = "001.009.html"
#